{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[{"file_id":"1Hf16ulA0nxJ1d3T97YYvscpix-jsrhRe","timestamp":1732206030121}],"gpuType":"T4"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"WYhB2OARw_Nq","executionInfo":{"status":"ok","timestamp":1732207299561,"user_tz":-330,"elapsed":20112,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"6b0b5bb5-f730-4713-b140-0767e7e615aa"},"outputs":[{"output_type":"stream","name":"stdout","text":["\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m2.4/2.4 MB\u001b[0m \u001b[31m25.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m302.0/302.0 kB\u001b[0m \u001b[31m18.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m108.9/108.9 kB\u001b[0m \u001b[31m7.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m3.1/3.1 MB\u001b[0m \u001b[31m20.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m49.5/49.5 kB\u001b[0m \u001b[31m1.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25h"]}],"source":["!pip install --upgrade --quiet  langchain langchain-community langchain-groq neo4j"]},{"cell_type":"code","source":["NEO4J_URI=\"neo4j+s://efe1a363.databases.neo4j.io\"\n","NEO4J_USERNAME=\"neo4j\"\n","NEO4J_PASSWORD=\"nV1pfBkPrsj2J_4CvlrlBWV8wc6kFv01b8xz8hV1fK8\"\n","AURA_INSTANCEID=\"efe1a363\"\n","AURA_INSTANCENAME=\"Instance01\"\n"],"metadata":{"id":"OBL8Iqs4xoeh","executionInfo":{"status":"ok","timestamp":1732207357177,"user_tz":-330,"elapsed":562,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":5,"outputs":[]},{"cell_type":"code","source":["import os\n","os.environ[\"NEO4J_URI\"]=NEO4J_URI\n","os.environ[\"NEO4J_USERNAME\"]=NEO4J_USERNAME\n","os.environ[\"NEO4J_PASSWORD\"]=NEO4J_PASSWORD"],"metadata":{"id":"uDS6XHgbycee","executionInfo":{"status":"ok","timestamp":1732207358801,"user_tz":-330,"elapsed":3,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":6,"outputs":[]},{"cell_type":"code","source":["from langchain_community.graphs import Neo4jGraph\n","graph=Neo4jGraph(\n","    url=NEO4J_URI,\n","    username=NEO4J_USERNAME,\n","    password=NEO4J_PASSWORD,\n",")"],"metadata":{"id":"5rikUUiCymWG","executionInfo":{"status":"ok","timestamp":1732207363881,"user_tz":-330,"elapsed":4352,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":7,"outputs":[]},{"cell_type":"code","source":["graph"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"j6Zy5Bc_y1oN","executionInfo":{"status":"ok","timestamp":1732207368226,"user_tz":-330,"elapsed":484,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"b342383a-b9ca-4f1b-96c6-0ee664a5ddeb"},"execution_count":8,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<langchain_community.graphs.neo4j_graph.Neo4jGraph at 0x7a76345ffd90>"]},"metadata":{},"execution_count":8}]},{"cell_type":"code","source":["groq_api_key=\"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\""],"metadata":{"id":"55sZpcz8y2dx","executionInfo":{"status":"ok","timestamp":1732207371178,"user_tz":-330,"elapsed":463,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":9,"outputs":[]},{"cell_type":"code","source":["from langchain_groq import ChatGroq\n","\n","llm=ChatGroq(groq_api_key=groq_api_key,model_name=\"Gemma2-9b-It\")\n","llm"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"YtqR-fXVzxXZ","executionInfo":{"status":"ok","timestamp":1732207373492,"user_tz":-330,"elapsed":1071,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"11ccbad8-5a2f-451d-f3e2-eabfcaa64a6f"},"execution_count":10,"outputs":[{"output_type":"execute_result","data":{"text/plain":["ChatGroq(client=<groq.resources.chat.completions.Completions object at 0x7a7633e76710>, async_client=<groq.resources.chat.completions.AsyncCompletions object at 0x7a7633e8e650>, model_name='Gemma2-9b-It', model_kwargs={}, groq_api_key=SecretStr('**********'))"]},"metadata":{},"execution_count":10}]},{"cell_type":"code","source":["from langchain_core.documents import Document\n","text=\"\"\"\n","Elon Reeve Musk (born June 28, 1971) is a businessman and investor known for his key roles in space\n","company SpaceX and automotive company Tesla, Inc. Other involvements include ownership of X Corp.,\n","formerly Twitter, and his role in the founding of The Boring Company, xAI, Neuralink and OpenAI.\n","He is one of the wealthiest people in the world; as of July 2024, Forbes estimates his net worth to be\n","US$221 billion.Musk was born in Pretoria to Maye and engineer Errol Musk, and briefly attended\n","the University of Pretoria before immigrating to Canada at age 18, acquiring citizenship through\n","his Canadian-born mother. Two years later, he matriculated at Queen's University at Kingston in Canada.\n","Musk later transferred to the University of Pennsylvania and received bachelor's degrees in economics\n"," and physics. He moved to California in 1995 to attend Stanford University, but dropped out after\n","  two days and, with his brother Kimbal, co-founded online city guide software company Zip2.\n"," \"\"\"\n","documents=[Document(page_content=text)]\n","documents"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"tMw2lopJ0XnX","executionInfo":{"status":"ok","timestamp":1732207375889,"user_tz":-330,"elapsed":470,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"73607dba-c68e-4177-fe73-bd208240550f"},"execution_count":11,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[Document(metadata={}, page_content=\"\\nElon Reeve Musk (born June 28, 1971) is a businessman and investor known for his key roles in space\\ncompany SpaceX and automotive company Tesla, Inc. Other involvements include ownership of X Corp.,\\nformerly Twitter, and his role in the founding of The Boring Company, xAI, Neuralink and OpenAI.\\nHe is one of the wealthiest people in the world; as of July 2024, Forbes estimates his net worth to be\\nUS$221 billion.Musk was born in Pretoria to Maye and engineer Errol Musk, and briefly attended\\nthe University of Pretoria before immigrating to Canada at age 18, acquiring citizenship through\\nhis Canadian-born mother. Two years later, he matriculated at Queen's University at Kingston in Canada.\\nMusk later transferred to the University of Pennsylvania and received bachelor's degrees in economics\\n and physics. He moved to California in 1995 to attend Stanford University, but dropped out after\\n  two days and, with his brother Kimbal, co-founded online city guide software company Zip2.\\n \")]"]},"metadata":{},"execution_count":11}]},{"cell_type":"code","source":["!pip install --upgrade --quiet langchain_experimental"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"6mbEhsdS1Y0N","executionInfo":{"status":"ok","timestamp":1732207381641,"user_tz":-330,"elapsed":3371,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"f2d8bb9f-6478-4ca4-f52e-aca29bf1a575"},"execution_count":12,"outputs":[{"output_type":"stream","name":"stdout","text":["\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/209.0 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m209.0/209.0 kB\u001b[0m \u001b[31m8.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25h"]}]},{"cell_type":"code","source":["from langchain_experimental.graph_transformers import LLMGraphTransformer\n","llm_transformer=LLMGraphTransformer(llm=llm)"],"metadata":{"id":"8ripzwTX0q1X","executionInfo":{"status":"ok","timestamp":1732207391782,"user_tz":-330,"elapsed":458,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":13,"outputs":[]},{"cell_type":"code","source":["graph_documents=llm_transformer.convert_to_graph_documents(documents)"],"metadata":{"id":"QedL67iH1ujK","executionInfo":{"status":"ok","timestamp":1732207397348,"user_tz":-330,"elapsed":4070,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":14,"outputs":[]},{"cell_type":"code","source":["graph_documents"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"uAdF2BZm13w4","executionInfo":{"status":"ok","timestamp":1732207398985,"user_tz":-330,"elapsed":5,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"859a3b75-e5d6-462e-da50-3793130a3165"},"execution_count":15,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[GraphDocument(nodes=[Node(id='Elon Reeve Musk', type='Person', properties={}), Node(id='Maye', type='Person', properties={}), Node(id='Errol Musk', type='Person', properties={}), Node(id='University Of Pretoria', type='University', properties={}), Node(id='Canada', type='Location', properties={}), Node(id=\"Queen'S University\", type='University', properties={}), Node(id='Kingston', type='Location', properties={}), Node(id='University Of Pennsylvania', type='University', properties={}), Node(id='California', type='Location', properties={}), Node(id='Stanford University', type='University', properties={}), Node(id='Kimbal', type='Person', properties={}), Node(id='Zip2', type='Company', properties={}), Node(id='Spacex', type='Company', properties={}), Node(id='Tesla, Inc.', type='Company', properties={}), Node(id='X Corp.', type='Company', properties={}), Node(id='Twitter', type='Company', properties={}), Node(id='The Boring Company', type='Company', properties={}), Node(id='Xai', type='Company', properties={}), Node(id='Neuralink', type='Company', properties={}), Node(id='Openai', type='Company', properties={}), Node(id='Forbes', type='Organization', properties={})], relationships=[Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Maye', type='Person', properties={}), type='PARENT', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Errol Musk', type='Person', properties={}), type='PARENT', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='University Of Pretoria', type='University', properties={}), type='ATTENDED', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Canada', type='Location', properties={}), type='IMMIGRATION', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id=\"Queen'S University\", type='University', properties={}), type='ATTENDED', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='University Of Pennsylvania', type='University', properties={}), type='ATTENDED', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='California', type='Location', properties={}), type='IMMIGRATION', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Stanford University', type='University', properties={}), type='ATTENDED', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Kimbal', type='Person', properties={}), type='SIBLING', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Zip2', type='Company', properties={}), type='FOUNDER', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Spacex', type='Company', properties={}), type='KEY_ROLE', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Tesla, Inc.', type='Company', properties={}), type='KEY_ROLE', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='X Corp.', type='Company', properties={}), type='OWNERSHIP', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Twitter', type='Company', properties={}), type='OWNERSHIP', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='The Boring Company', type='Company', properties={}), type='FOUNDER', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Xai', type='Company', properties={}), type='FOUNDER', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Neuralink', type='Company', properties={}), type='FOUNDER', properties={}), Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Openai', type='Company', properties={}), type='FOUNDER', properties={}), Relationship(source=Node(id='Forbes', type='Organization', properties={}), target=Node(id='Elon Reeve Musk', type='Person', properties={}), type='NET_WORTH_ESTIMATE', properties={})], source=Document(metadata={}, page_content=\"\\nElon Reeve Musk (born June 28, 1971) is a businessman and investor known for his key roles in space\\ncompany SpaceX and automotive company Tesla, Inc. Other involvements include ownership of X Corp.,\\nformerly Twitter, and his role in the founding of The Boring Company, xAI, Neuralink and OpenAI.\\nHe is one of the wealthiest people in the world; as of July 2024, Forbes estimates his net worth to be\\nUS$221 billion.Musk was born in Pretoria to Maye and engineer Errol Musk, and briefly attended\\nthe University of Pretoria before immigrating to Canada at age 18, acquiring citizenship through\\nhis Canadian-born mother. Two years later, he matriculated at Queen's University at Kingston in Canada.\\nMusk later transferred to the University of Pennsylvania and received bachelor's degrees in economics\\n and physics. He moved to California in 1995 to attend Stanford University, but dropped out after\\n  two days and, with his brother Kimbal, co-founded online city guide software company Zip2.\\n \"))]"]},"metadata":{},"execution_count":15}]},{"cell_type":"code","source":["graph_documents[0].nodes"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"h3pSzKLE2OJj","executionInfo":{"status":"ok","timestamp":1732207403764,"user_tz":-330,"elapsed":543,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"a1a8c954-65ae-4f15-d8ad-50fbe6b625e6"},"execution_count":16,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[Node(id='Elon Reeve Musk', type='Person', properties={}),\n"," Node(id='Maye', type='Person', properties={}),\n"," Node(id='Errol Musk', type='Person', properties={}),\n"," Node(id='University Of Pretoria', type='University', properties={}),\n"," Node(id='Canada', type='Location', properties={}),\n"," Node(id=\"Queen'S University\", type='University', properties={}),\n"," Node(id='Kingston', type='Location', properties={}),\n"," Node(id='University Of Pennsylvania', type='University', properties={}),\n"," Node(id='California', type='Location', properties={}),\n"," Node(id='Stanford University', type='University', properties={}),\n"," Node(id='Kimbal', type='Person', properties={}),\n"," Node(id='Zip2', type='Company', properties={}),\n"," Node(id='Spacex', type='Company', properties={}),\n"," Node(id='Tesla, Inc.', type='Company', properties={}),\n"," Node(id='X Corp.', type='Company', properties={}),\n"," Node(id='Twitter', type='Company', properties={}),\n"," Node(id='The Boring Company', type='Company', properties={}),\n"," Node(id='Xai', type='Company', properties={}),\n"," Node(id='Neuralink', type='Company', properties={}),\n"," Node(id='Openai', type='Company', properties={}),\n"," Node(id='Forbes', type='Organization', properties={})]"]},"metadata":{},"execution_count":16}]},{"cell_type":"code","source":["graph_documents[0].relationships"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"DvvdoA5W2fEZ","executionInfo":{"status":"ok","timestamp":1732207407878,"user_tz":-330,"elapsed":475,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"a534d697-2946-417d-c01b-b4ba2f00965c"},"execution_count":17,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Maye', type='Person', properties={}), type='PARENT', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Errol Musk', type='Person', properties={}), type='PARENT', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='University Of Pretoria', type='University', properties={}), type='ATTENDED', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Canada', type='Location', properties={}), type='IMMIGRATION', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id=\"Queen'S University\", type='University', properties={}), type='ATTENDED', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='University Of Pennsylvania', type='University', properties={}), type='ATTENDED', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='California', type='Location', properties={}), type='IMMIGRATION', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Stanford University', type='University', properties={}), type='ATTENDED', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Kimbal', type='Person', properties={}), type='SIBLING', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Zip2', type='Company', properties={}), type='FOUNDER', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Spacex', type='Company', properties={}), type='KEY_ROLE', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Tesla, Inc.', type='Company', properties={}), type='KEY_ROLE', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='X Corp.', type='Company', properties={}), type='OWNERSHIP', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Twitter', type='Company', properties={}), type='OWNERSHIP', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='The Boring Company', type='Company', properties={}), type='FOUNDER', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Xai', type='Company', properties={}), type='FOUNDER', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Neuralink', type='Company', properties={}), type='FOUNDER', properties={}),\n"," Relationship(source=Node(id='Elon Reeve Musk', type='Person', properties={}), target=Node(id='Openai', type='Company', properties={}), type='FOUNDER', properties={}),\n"," Relationship(source=Node(id='Forbes', type='Organization', properties={}), target=Node(id='Elon Reeve Musk', type='Person', properties={}), type='NET_WORTH_ESTIMATE', properties={})]"]},"metadata":{},"execution_count":17}]},{"cell_type":"code","source":["### Load the dataset of movie\n","\n","movie_query=\"\"\"\n","LOAD CSV WITH HEADERS FROM\n","'https://raw.githubusercontent.com/tomasonjo/blog-datasets/main/movies/movies_small.csv' as row\n","\n","MERGE(m:Movie{id:row.movieId})\n","SET m.released = date(row.released),\n","    m.title = row.title,\n","    m.imdbRating = toFloat(row.imdbRating)\n","FOREACH (director in split(row.director, '|') |\n","    MERGE (p:Person {name:trim(director)})\n","    MERGE (p)-[:DIRECTED]->(m))\n","FOREACH (actor in split(row.actors, '|') |\n","    MERGE (p:Person {name:trim(actor)})\n","    MERGE (p)-[:ACTED_IN]->(m))\n","FOREACH (genre in split(row.genres, '|') |\n","    MERGE (g:Genre {name:trim(genre)})\n","    MERGE (m)-[:IN_GENRE]->(g))\n","\"\"\""],"metadata":{"id":"EPOewFsm5DZv","executionInfo":{"status":"ok","timestamp":1732207414635,"user_tz":-330,"elapsed":572,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":18,"outputs":[]},{"cell_type":"code","source":["graph"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"UeRdr8nm7rAw","executionInfo":{"status":"ok","timestamp":1732207417618,"user_tz":-330,"elapsed":626,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"58fca176-1206-4c13-e22a-875aec76605c"},"execution_count":19,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<langchain_community.graphs.neo4j_graph.Neo4jGraph at 0x7a76345ffd90>"]},"metadata":{},"execution_count":19}]},{"cell_type":"code","source":["graph.query(movie_query)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"6YeLz1st7rp2","executionInfo":{"status":"ok","timestamp":1732207420700,"user_tz":-330,"elapsed":2430,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"82926f19-bc93-4098-b0e2-520deec32ebc"},"execution_count":20,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":20}]},{"cell_type":"code","source":["graph.refresh_schema()\n","print(graph.schema)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"nQm5agJA7xnH","executionInfo":{"status":"ok","timestamp":1732207422683,"user_tz":-330,"elapsed":1986,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"62e4ef0a-627b-46aa-af40-b77fbf21ff14"},"execution_count":21,"outputs":[{"output_type":"stream","name":"stdout","text":["Node properties:\n","Movie {id: STRING, released: DATE, title: STRING, imdbRating: FLOAT}\n","Person {name: STRING}\n","Genre {name: STRING}\n","Relationship properties:\n","\n","The relationships:\n","(:Movie)-[:IN_GENRE]->(:Genre)\n","(:Person)-[:DIRECTED]->(:Movie)\n","(:Person)-[:ACTED_IN]->(:Movie)\n"]}]},{"cell_type":"code","source":["from langchain.chains import GraphCypherQAChain\n","chain=GraphCypherQAChain.from_llm(llm=llm,graph=graph,verbose=True,allow_dangerous_requests=True)\n","chain"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"tGUot6uZ8wnj","executionInfo":{"status":"ok","timestamp":1732207470022,"user_tz":-330,"elapsed":574,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"77a3d69f-e8ec-439b-ba45-cff84fe2fc25"},"execution_count":23,"outputs":[{"output_type":"execute_result","data":{"text/plain":["GraphCypherQAChain(verbose=True, graph=<langchain_community.graphs.neo4j_graph.Neo4jGraph object at 0x7a76345ffd90>, cypher_generation_chain=LLMChain(verbose=False, prompt=PromptTemplate(input_variables=['question', 'schema'], input_types={}, partial_variables={}, template='Task:Generate Cypher statement to query a graph database.\\nInstructions:\\nUse only the provided relationship types and properties in the schema.\\nDo not use any other relationship types or properties that are not provided.\\nSchema:\\n{schema}\\nNote: Do not include any explanations or apologies in your responses.\\nDo not respond to any questions that might ask anything else than for you to construct a Cypher statement.\\nDo not include any text except the generated Cypher statement.\\n\\nThe question is:\\n{question}'), llm=ChatGroq(client=<groq.resources.chat.completions.Completions object at 0x7a7633e76710>, async_client=<groq.resources.chat.completions.AsyncCompletions object at 0x7a7633e8e650>, model_name='Gemma2-9b-It', model_kwargs={}, groq_api_key=SecretStr('**********')), output_parser=StrOutputParser(), llm_kwargs={}), qa_chain=LLMChain(verbose=False, prompt=PromptTemplate(input_variables=['context', 'question'], input_types={}, partial_variables={}, template=\"You are an assistant that helps to form nice and human understandable answers.\\nThe information part contains the provided information that you must use to construct an answer.\\nThe provided information is authoritative, you must never doubt it or try to use your internal knowledge to correct it.\\nMake the answer sound as a response to the question. Do not mention that you based the result on the given information.\\nHere is an example:\\n\\nQuestion: Which managers own Neo4j stocks?\\nContext:[manager:CTL LLC, manager:JANE STREET GROUP LLC]\\nHelpful Answer: CTL LLC, JANE STREET GROUP LLC owns Neo4j stocks.\\n\\nFollow this example when generating answers.\\nIf the provided information is empty, say that you don't know the answer.\\nInformation:\\n{context}\\n\\nQuestion: {question}\\nHelpful Answer:\"), llm=ChatGroq(client=<groq.resources.chat.completions.Completions object at 0x7a7633e76710>, async_client=<groq.resources.chat.completions.AsyncCompletions object at 0x7a7633e8e650>, model_name='Gemma2-9b-It', model_kwargs={}, groq_api_key=SecretStr('**********')), output_parser=StrOutputParser(), llm_kwargs={}), graph_schema='Node properties are the following:\\nMovie {id: STRING, released: DATE, title: STRING, imdbRating: FLOAT},Person {name: STRING},Genre {name: STRING}\\nRelationship properties are the following:\\n\\nThe relationships are the following:\\n(:Movie)-[:IN_GENRE]->(:Genre),(:Person)-[:DIRECTED]->(:Movie),(:Person)-[:ACTED_IN]->(:Movie)', allow_dangerous_requests=True)"]},"metadata":{},"execution_count":23}]},{"cell_type":"code","source":["response=chain.invoke({\"query\":\"Who was the director of the moview GoldenEye\"})\n","\n","response\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"53tukPgo9Ab9","executionInfo":{"status":"ok","timestamp":1732207473701,"user_tz":-330,"elapsed":1603,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"52dfdef4-db41-467e-a66c-7525d274227e"},"execution_count":24,"outputs":[{"output_type":"stream","name":"stdout","text":["\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (m:Movie {title: \"GoldenEye\"})<-[:DIRECTED]-(p:Person) RETURN p.name\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[{'p.name': 'Martin Campbell'}]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n"]},{"output_type":"execute_result","data":{"text/plain":["{'query': 'Who was the director of the moview GoldenEye',\n"," 'result': 'Martin Campbell  \\n'}"]},"metadata":{},"execution_count":24}]},{"cell_type":"code","source":["response=chain.invoke({\"query\":\"tell me the genre of th movie GoldenEye\"})\n","\n","response"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"mlipgwFC9WD4","executionInfo":{"status":"ok","timestamp":1732207481786,"user_tz":-330,"elapsed":1341,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"a1cbf361-d861-4790-b50b-8549c5dabab5"},"execution_count":25,"outputs":[{"output_type":"stream","name":"stdout","text":["\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (m:Movie {title: \"GoldenEye\"})-[r:IN_GENRE]->(g:Genre) RETURN g.name \n","\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[{'g.name': 'Adventure'}, {'g.name': 'Action'}, {'g.name': 'Thriller'}]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n"]},{"output_type":"execute_result","data":{"text/plain":["{'query': 'tell me the genre of th movie GoldenEye',\n"," 'result': \"I don't know the answer. \\n\"}"]},"metadata":{},"execution_count":25}]},{"cell_type":"code","source":["response=chain.invoke({\"query\":\"Who was the director in movie Casino\"})\n","\n","response"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Sjfw-Dzp9gN4","executionInfo":{"status":"ok","timestamp":1732207484319,"user_tz":-330,"elapsed":1300,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"828b7fee-8b5b-4003-836c-053e169604fc"},"execution_count":26,"outputs":[{"output_type":"stream","name":"stdout","text":["\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (m:Movie {title: \"Casino\"})<-[:DIRECTED]-(p:Person)RETURN p.name\n","\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[{'p.name': 'Martin Scorsese'}]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n"]},{"output_type":"execute_result","data":{"text/plain":["{'query': 'Who was the director in movie Casino',\n"," 'result': 'Martin Scorsese  was the director in movie Casino. \\n'}"]},"metadata":{},"execution_count":26}]},{"cell_type":"code","source":["response=chain.invoke({\"query\":\"Which movie were released in 2008\"})\n","\n","response"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ksOQww5J-Dqa","executionInfo":{"status":"ok","timestamp":1732207485796,"user_tz":-330,"elapsed":1483,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"09a19568-83be-4f34-85e0-1f8adf36b03f"},"execution_count":27,"outputs":[{"output_type":"stream","name":"stdout","text":["\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (m:Movie)\n","WHERE m.released = '2008'\n","RETURN m.title  \n","\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n"]},{"output_type":"execute_result","data":{"text/plain":["{'query': 'Which movie were released in 2008',\n"," 'result': \"I don't know the answer. \\n\"}"]},"metadata":{},"execution_count":27}]},{"cell_type":"code","source":["response=chain.invoke({\"query\":\"Give me the list of movie having imdb rating more than 8\"})\n","response"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ca614gfG-2ge","executionInfo":{"status":"ok","timestamp":1732207486509,"user_tz":-330,"elapsed":719,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"a482dceb-123a-40d2-d475-039cd6b9a16a"},"execution_count":28,"outputs":[{"output_type":"stream","name":"stdout","text":["\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (m:Movie)\n","WHERE m.imdbRating > 8\n","RETURN m.title\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[{'m.title': 'Toy Story'}, {'m.title': 'Heat'}, {'m.title': 'Casino'}, {'m.title': 'Twelve Monkeys (a.k.a. 12 Monkeys)'}, {'m.title': 'Seven (a.k.a. Se7en)'}, {'m.title': 'Usual Suspects, The'}, {'m.title': 'Hate (Haine, La)'}, {'m.title': 'Braveheart'}, {'m.title': 'Taxi Driver'}, {'m.title': 'Anne Frank Remembered'}]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n"]},{"output_type":"execute_result","data":{"text/plain":["{'query': 'Give me the list of movie having imdb rating more than 8',\n"," 'result': \"I don't know the answer. \\n\"}"]},"metadata":{},"execution_count":28}]},{"cell_type":"code","source":["examples = [\n","    {\n","        \"question\": \"How many artists are there?\",\n","        \"query\": \"MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)\",\n","    },\n","    {\n","        \"question\": \"Which actors played in the movie Casino?\",\n","        \"query\": \"MATCH (m:Movie {{title: 'Casino'}})<-[:ACTED_IN]-(a) RETURN a.name\",\n","    },\n","    {\n","        \"question\": \"How many movies has Tom Hanks acted in?\",\n","        \"query\": \"MATCH (a:Person {name: 'Tom Hanks'})-[:ACTED_IN]->(m:Movie) RETURN count(m)\",\n","    },\n","    {\n","        \"question\": \"List all the genres of the movie Schindler's List\",\n","        \"query\": \"MATCH (m:Movie {{title: 'Schindler\\\\'s List'}})-[:IN_GENRE]->(g:Genre) RETURN g.name\",\n","    },\n","]"],"metadata":{"id":"G0u93nW-_Sy7","executionInfo":{"status":"ok","timestamp":1732207683429,"user_tz":-330,"elapsed":1037,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}}},"execution_count":34,"outputs":[]},{"cell_type":"code","source":["for example in examples:\n","  print(chain.invoke({example['question']}))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"8M_SjPuMm6Ot","executionInfo":{"status":"ok","timestamp":1732207686829,"user_tz":-330,"elapsed":3406,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"4149d89e-ded0-4a66-ba00-660850eaa0e2"},"execution_count":35,"outputs":[{"output_type":"stream","name":"stdout","text":["\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (p:Person) RETURN count(p) \n","\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[{'count(p)': 1239}]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n","{'query': {'How many artists are there?'}, 'result': 'There are 1239 artists. \\n'}\n","\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (m:Movie {title: \"Casino\"})<-[:ACTED_IN]-(p:Person) RETURN p.name\n","\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[{'p.name': 'Robert De Niro'}, {'p.name': 'Joe Pesci'}, {'p.name': 'Sharon Stone'}, {'p.name': 'James Woods'}]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n","{'query': {'Which actors played in the movie Casino?'}, 'result': 'Robert De Niro, Joe Pesci, Sharon Stone, and James Woods.  \\n'}\n","\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_IN]->(m:Movie)\n","RETURN count(m)\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[{'count(m)': 2}]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n","{'query': {'How many movies has Tom Hanks acted in?'}, 'result': \"I don't know the answer. \\n\"}\n","\n","\n","\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n","Generated Cypher:\n","\u001b[32;1m\u001b[1;3mMATCH (m:Movie {title: \"Schindler's List\"})<-[:IN_GENRE]-(g:Genre) RETURN g.name\u001b[0m\n","Full Context:\n","\u001b[32;1m\u001b[1;3m[]\u001b[0m\n","\n","\u001b[1m> Finished chain.\u001b[0m\n","{'query': {\"List all the genres of the movie Schindler's List\"}, 'result': \"I don't know the answer. \\n\"}\n"]}]},{"cell_type":"code","source":["!git config --global user.email \"you@example.com\"\n","!git config --global user.name \"Your \""],"metadata":{"id":"i4YDaYU4pJtM"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["!echo \"# GraphDB_with_Langchain\" >> README.md\n","!git init\n","!git add README.md\n","!git commit -m \"first commit\"\n","!git branch -M main\n","!git remote add origin https://github.com/srivatsavatla/GraphDB_with_Langchain.git"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Hz0pADPxnTZ5","executionInfo":{"status":"ok","timestamp":1732207992620,"user_tz":-330,"elapsed":1197,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"a393c9eb-fbfb-4768-8435-a9da43eaf26d"},"execution_count":6,"outputs":[{"output_type":"stream","name":"stdout","text":["\u001b[33mhint: Using 'master' as the name for the initial branch. This default branch name\u001b[m\n","\u001b[33mhint: is subject to change. To configure the initial branch name to use in all\u001b[m\n","\u001b[33mhint: of your new repositories, which will suppress this warning, call:\u001b[m\n","\u001b[33mhint: \u001b[m\n","\u001b[33mhint: \tgit config --global init.defaultBranch <name>\u001b[m\n","\u001b[33mhint: \u001b[m\n","\u001b[33mhint: Names commonly chosen instead of 'master' are 'main', 'trunk' and\u001b[m\n","\u001b[33mhint: 'development'. The just-created branch can be renamed via this command:\u001b[m\n","\u001b[33mhint: \u001b[m\n","\u001b[33mhint: \tgit branch -m <name>\u001b[m\n","Initialized empty Git repository in /content/drive/MyDrive/Colab Notebooks/.git/\n","Author identity unknown\n","\n","*** Please tell me who you are.\n","\n","Run\n","\n","  git config --global user.email \"you@example.com\"\n","  git config --global user.name \"Your Name\"\n","\n","to set your account's default identity.\n","Omit --global to set the identity only in this repository.\n","\n","fatal: unable to auto-detect email address (got 'root@12665eab8e82.(none)')\n"]}]},{"cell_type":"code","source":["%cd /content/drive/MyDrive/Colab Notebooks"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"fmgwMoBFobsi","executionInfo":{"status":"ok","timestamp":1732207953507,"user_tz":-330,"elapsed":403,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"5865e069-a411-4ee1-d743-9ce15f43fd1e"},"execution_count":4,"outputs":[{"output_type":"stream","name":"stdout","text":["/content/drive/MyDrive/Colab Notebooks\n"]}]},{"cell_type":"code","source":["!git add GraphDB_and_Langchain.ipynb"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"PNdVBE0_ojm-","executionInfo":{"status":"ok","timestamp":1732207981183,"user_tz":-330,"elapsed":401,"user":{"displayName":"atla srivatsav","userId":"05461943304358474004"}},"outputId":"0159bfb8-7c7a-4051-d0b4-e7e19c9f252e"},"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["fatal: not a git repository (or any parent up to mount point /content)\n","Stopping at filesystem boundary (GIT_DISCOVERY_ACROSS_FILESYSTEM not set).\n"]}]},{"cell_type":"code","source":[],"metadata":{"id":"YuGt_T-dovl2"},"execution_count":null,"outputs":[]}]}